Revit 2027 API
BuiltInFailures.RebarShapeFailures.MultiPlanarDepth Property
 Multi-planar depth of Rebar Shape can't be too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultiPlanarDepth { get; }
Public Shared ReadOnly Property MultiPlanarDepth As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultiPlanarDepth {
	FailureDefinitionId^ get ();
}
static member MultiPlanarDepth : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace